In [4]:
import numpy as np
import pandas as pd

In [12]:
df=pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df.to_csv('My_CSV',index= False)

In [9]:
pd.read_csv('My_CSV')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [15]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1',index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [2]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet2')

NameError: name 'df' is not defined

In [5]:
df=pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')
df[0].head(5)

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date,Fund Sort ascending
0,The Santa Anna National Bank,Santa Anna,Texas,5520,Coleman County State Bank,"June 27, 2025",10549
1,Pulaski Savings Bank,Chicago,Illinois,28611,Millennium Bank,"January 17, 2025",10548
2,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,First Bank & Trust Co.,"October 18, 2024",10547
3,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
4,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545

In [6]:
from sqlalchemy import create_engine

In [13]:
engine = create_engine('sqlite:///:memory:')

In [15]:
df.to_sql('my_table', engine)

4

In [16]:
sqldf=pd.read_sql('my_table',con=engine)

In [17]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15